/**
 * Created by Bogdan on 8/2/2016.
 */

import{GET_NEWS_REQUEST,GET_NEWS_SUCCES,GET_FILTERED_NEWS_SUCCES,UPDATE_NEWS,INIT_DONE,ROOT_URL } from '../constants/newsList'
const DoneNews =[
      {
         "id": 1294,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "1 SFLKJasflkafIpsum",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      },
      {
         "id": 1298,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "2      LKAJSFLKJasflkafIpsum",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      },
      {
         "id": 1295,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "3",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }, {
         "id": 1299,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "4",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }, {
         "id": 52,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "5",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }, {
         "id": 491,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "6",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      },
    {
         "id": 3295,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "4",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }, {
         "id": 2294,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "5",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }, {
         "id": 1198,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "8",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }
   ]
const updateNewsList={
         "id": 1691,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "7",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }
const doubleUpdt={
             "id": 1697,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "HYI",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
}


const DoneFilterNews =[
      {
         "id": 1294,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "1 SFLKJasflkafIpsum",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      },
      {
         "id": 1298,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "2      LKAJSFLKJasflkafIpsum",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      },
      {
         "id": 1295,
         "source": 1,
         "category": 2,
         "text": "BABBABABABABABBBABABBABABBABabодібно. Якщо ви збираєтесь використовувати Lorem Ipsum, ви маєте упевнитись в тому, що всередині тексту не приховано нічого, що могло б викликати у читача конфуз. Більшість відомих генераторів Lorem Ipsum в Мережі генерують текст шляхом повторення наперед заданих послідовностей Lorem Ipsum. Принципова відмінність цього генератора робить його першим справжнім генератором Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.",
         "native_title": "3",
         "native_img": "",
         "native_text": "передает Цензор.НЕТ.По его словам, все они будут распределены между тремя действующими пунктами пропуска - где они и будут осуществлять свою деятельность в ближайшие дни. По словам Слободяна,  будут вмешиваться в работу контрольных служб.Читайте на : Министр обороны России Шойгу проверяет боевую подготовку оккупантов в Крымункция ",
         "native_url": "http://sport.lb.ua/football/2016/03/22/330913_fifa_nachala_rassledovat_vibor.html",
         "date": "03.22.2016 20:04"
      }]
export function getNews() {
    
    return (dispatch)=>{
    dispatch({
      type: GET_NEWS_REQUEST
    })
        
    setTimeout(() => {
      dispatch({
        type: GET_NEWS_SUCCES,
        payload: DoneNews
      })
    }, 500)
    }
}
export function getFilteredNews() {
    
    return (dispatch)=>{
    dispatch({
      type: GET_NEWS_REQUEST
    })
        
    setTimeout(() => {
      dispatch({
        type: GET_FILTERED_NEWS_SUCCES,
        payload: DoneFilterNews
      })
    }, 500)
    }
}
export function initDone() {

    return (dispatch)=> {
        dispatch({
            type: INIT_DONE
        })
    }
}
export function updateNews() {
    return(dispatch)=> {
        dispatch({
            type: GET_NEWS_REQUEST
        })
        setTimeout(() => {
            dispatch({
                type: UPDATE_NEWS,
                payload: updateNewsList
            })
        }, 2400)
        setTimeout(() => {
            dispatch({
                type: UPDATE_NEWS,
                payload: doubleUpdt
            })
        }, 4400)

    }
}
